Repository: amarcinkowski/accessible-poetry
Catalog: lang/acp-*.po
Languages: he_il

source: Welcome to Accessible Poetry!
he_il: ברוכים הבאים ל-accessible Poetry

source: Version
he_il: גרסה

source: Here you will find options to perform a better accessibility WordPress website.
he_il: תוסף זה מעניק מבחר אפשרויות לשיפור נגישות אתר האינטרנט. התוסף אינו מהווה תחליף להנגשת אתר כחלק מהחוק הנגישות בישראל, אך פותר חלק נכבד מהמתבקש.

source: This plugin is provided by
he_il: תוסף זה מופעל ע״י

source: Amit Moreno
he_il: עמית מורנו

source: Please visit our
he_il: בקר/י ב

source: Go to our Plugin Page
he_il: עבור לעמוד התוסף

source: Plugin Page
he_il: עמוד התוסף

source: and
he_il: ו

source: Rate Us on our Plugin Page
he_il: דרגו את התוסף

source: Rate Us
he_il: דרג/י את התוסף

source: General
he_il: כללי

source: Add language attribute to the html tag.
he_il: הוספת תכונת השפה לתגית html

source: Toolbar
he_il: סרגל נגישות

source: Toolbar Side
he_il: צד סרגל הנגישות

source: Left
he_il: שמאל

source: Right
he_il: ימין

source: Icon position
he_il: מיקום האייקון

source: Icon size (default is medium)
he_il: גודל האייקון

source: Small
he_il: מוקטן

source: Medium
he_il: רגיל

source: Contrast
he_il: ניגודיות

source: Affect additional elements with the contrast (separate elements with comma)
he_il: הוספת אלמנטים שעליהם תשפיע הניגודיות, ניתן להוסיף תגיות html, קלאסים ו-ID‪’‬s של אלמנטים (נא להפריד אלמנטים באמצעות פסיק)

source: Bright Contrast
he_il: ניגודיות בהירה

source: Don't use any style for the Bright option.
he_il: אל תשתמש בהגדרות עיצוב עבור ניגודיות בהירה

source: Affect on all the elements in Bright contrast mode.
he_il: השפע על כל האלמנטים שבאתר במצב ניגודיות בהירה

source: Use custom colors for the Bright option.
he_il: השתמש בצבעים מותאמים אישית עבור הניגודיות הבהירה

source: Custom Color for the Background of the Bright option.
he_il: צבע רקע מותאם עבור ניגודיות בהירה

source: Custom Color for the Text of the Bright option.
he_il: צבע טקסט מותאם עבור ניגודיות בהירה

source: Custom Color for the Link of the Bright option.
he_il: צבע קישור מותאם אישית עבור ניגודיות בהירה

source: Custom Color for the Link of the Bright option in hover & focus modes.
he_il: צבע קישור מותאם אישית בעת מעבר הסמן ובמצב פוקוס עבור ניגודיות כהה

source: Dark Contrast
he_il: ניגודיות כהה

source: Don't use any style for the Dark option.
he_il: אל תשתמש בהגדרות עיצוב עבור ניגודיות כהה

source: Affect on all the elements in Dark contrast mode.
he_il: השפע על כל האלמנטים שבאתר במצב ניגודיות כהה

source: Use custom colors for the Dark option.
he_il: השתמש בצבעים מותאמים אישית עבור הניגודיות הכהה

source: Custom Color for the Background in the Dark option.
he_il: צבע רקע מותאם עבור ניגודיות כהה

source: Custom Color for the Text in the Dark option.
he_il: צבע טקסט מותאם עבור ניגודיות כהה

source: Custom Color for the Link of the Dark option.
he_il: צבע קישור מותאם עבור ניגודיות כהה

source: Custom Color for the Link of the Dark option in hover & focus modes.
he_il: צבע קישור מותאם אישית בעת מעבר הסמן ובמצב פוקוס עבור ניגודיות בהירה

source: Font Sizer
he_il: משנה גודל גופן

source: Set the change of the font sizers in pixels.
he_il: הגדרת גודל הקפיצה בפיקסלים בעת הקטנה או הגדלה של גודל הגופן

source: Use custom tags, classes & id's with the Font sizer.
he_il: השפע על תגיות, קלאסים ו-ID‪’‬s מותאמים אישית

source: Write your custom tags, classes & id's for the Font sizer. separate items with a comma.
he_il: כאן ניתן להוסיף תגיות, קלאסים ו-ID‪’‬s מותאמים אישית עבור משנה גודל הגופן. יש להפריד בין הפריטים באמצעות פסיק

source: Skiplinks
he_il: קישורי דילוג (Skiplinks)

source: Skiplinks are links which aid navigation around the current page. the user who navigate with skiplinks do it with the Tab button.
he_il: קישורי דילוג מאפשרים לאדם המנווט באמצעות המקלדת לדלג למקומות מרכזיים בעמוד, כמו התפריט הראשי, התוכן הראשי וכד׳. הגולש מגיע אל קישורי הניווט באמצעות הלחצן Tab

source: Before you activate the skiplinks, you should check if your theme has already got Skiplinks (you can check it by pressing the Tab button when you first land on a page, the Skiplinks need to be the first links that will be focused to a keyboard user).
he_il: לפני הפעלת קישורי הדילוג יש לבדוק שהתבנית בה את/ה משתמש/ת אינה מכילה קישורי דילוג בעצמה. ניתן לעשות באמצעות מספר לחיצות על לחצן ה-Tab בעת נחיתה באחד העמודים, קישורים הדילוג אמורים להופיע בלחיצות הראשונות על מקש זה.

source: Enable Skiplinks
he_il: הפעלת קישורי דילוג

source: After activating this option a new menu will be registered with your built-in "Menus" of WP. You then will need to create custom menu and add to it "Links" that points to the area you want to target to, for example if the Name of the Skiplink is: "Skip to Content", so the value of the link will probably be "#content".
he_il: לאחר הפעלת קישורי הדילוג יווצר תפריט חדש בעמוד התפריטים של וורדפרס, לתפריט זה יש להוסיף את קישורי הדילוג ע״י הוספת קישור מותאם אישית שהערך אליו הוא מפנה הוא ה-ID של האלמנט שאליו הגולש ידלג. לדוגמה: אם ברצונך להוסיף קישור דילוג לתפריט הראשי, עליך לבדוק את ה-id של התפריט הראשי ולהוסיף אותו כקישור מותאם אישית לתפריט קישורי הדילוג עם הסימן ‪#‬ בהתחלה.

source: Skiplinks Side
he_il: מיקום קישורי הדילוג

source: Center (default)
he_il: מרכז

source: Use different links for Home page
he_il: השתמש בקישורי דילוג ייחודיים עבור דף הבית

source: This option will add another menu to your built-in WP Menus there you should set the permalinks for your Home page.
he_il: אפשרות זו מוסיפה תפריט קישורים נוסף עבור קישורי הדילוג שיופיעו בדף הבית

source: Use your own style for the skiplinks
he_il: השתמש בהגדרות עיצוב מותאמות אישית עבור קישורי הדילוג

source: Background color
he_il: צבע הרקע

source: Link color
he_il: צבע הקישור

source: Disable link underline
he_il: ביטול הקו התחתון מתחת לקישור

source: Links
he_il: קישורים

source: Add role="link" to all the &lt;a&gt; tag.
he_il: הוספת role‪=‬link לכל תגיות הקישורים

source: Force Open links in current tab (Remove the "target" attribute from all links).
he_il: מניעת פתיחה של קישורים בכרטיסיה חדשה

source: Change all title attributes on links to aria-label.
he_il: שינוי התכונה title ל-aria‪-‬label עבור כל הקישורים

source: Add outline to all links on focus mode.
he_il: הוספת אפקט על קישורים שנמצאים במצב פוקוס

source: Force underline for links.
he_il: הוספת קו תחתון לכל הקישורים

source: Images
he_il: תמונות

source: Force using ALT on all images.
he_il: הוספת ALT לכל התמונות שאין להם תכונה זו

source: Replacement for the image ALT
he_il: תחלופת מלל עבור טקסט חלופי לתמונות שלא הוזן עבורן טקסט חלופי

source: None
he_il: ללא

source: Use attachment title as ALT for images with no alt
he_il: השתמש בכותרת התמונה עבור טקסט חלופי לתמונות שאין להן טקסט חלופי

source: Use attachment description as ALT for images with no alt
he_il: השתמש בתיאור התמונה עבור טקסט חלופי לתמונות שאין להן טקסט חלופי

source: Homepage Skiplinks
he_il: קישורי דילוג עבור דף הבית

source: Accessibility
he_il: נגישות

source: Accessibility Toolbar
he_il: כלי נגישות

source: Decrease font size
he_il: הקטנת גודל הגופן

source: Increase font size
he_il: הגדלת גודל הגופן

source: Default font sizes
he_il: חזרה לגדלי גופן מקוריים

source: Bright contrast
he_il: ניגודיות בהירה

source: Dark contrast
he_il: ניגודיות כהה

source: Grayscale
he_il: שחור-לבן

source: Reset contrast
he_il: איפוס הניגודיות

source: Keyboard Navigation
he_il: ניווט מקלדת

source: Toggle underline
he_il: הוספת/הסרת קו תחתון לקישורים
